app/Controllers/Pdv.php

SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` = '2'
AND `id_login` = '3'
 LIMIT 1
SELECT *
FROM `caixas`
WHERE `id_empresa` = '2'
AND `status` = 'Aberto'
---
    public function index()
    {
        $data['link'] = [
            'li' => '2.x',
            'item' => '2.0',
            'subItem' => '2.6'
        ];

        $data['titulo'] = [
            'modulo' => 'Caixas Abertos',
            'icone'  => 'fa fa-plus-circle'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Caixas Abertos", 'rota'   => "", 'active' => true]
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $data['caixas'] = $this->caixa_model
                                ->where('id_empresa', $this->id_empresa)
                                ->where('status', 'Aberto')
                                ->findAll();

SELECT `id_cliente`, `tipo`, `nome`, `razao_social`
FROM `clientes`
WHERE `id_empresa` = '2'
SELECT `id_produto`, `nome`
FROM `produtos`
WHERE `id_empresa` = '2'
SELECT *
FROM `produtos_do_pdv`
WHERE `id_empresa` = '2'
---
    public function start($id_caixa)
    {
        $data['id_caixa'] = $id_caixa;

        $data['clientes'] = $this->cliente_model
                                ->where('id_empresa', $this->id_empresa)
                                ->select(
                                    'id_cliente,
                                    tipo,
                                    nome,
                                    razao_social
                                ')
                                ->findAll();

        $data['produtos'] = $this->produto_model
                                ->where('id_empresa', $this->id_empresa)
                                ->select(
                                    'id_produto,
                                    nome
                                ')


                                ->findAll();

        $data['produtos_do_pdv'] = $this->produto_pdv_model
                                        ->where('id_empresa', $this->id_empresa)
                                        ->findAll();

SELECT *
FROM `formas_de_pagamento`
SELECT *
FROM `vendedores`
WHERE `id_empresa` = '2'
---
                                    ->selectSum('valor_final')
                                    ->first();

        $data['formas_de_pagamento'] = $this->forma_de_pagamento_model
                                                                ->findAll();

        $data['vendedores'] = $this->vendedor_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->findAll();

SELECT `id_produto`, `nome`, `unidade`, `codigo_de_barras`, `valor_de_venda`, `NCM`, `CSOSN`, `CFOP_NFe`, `CFOP_NFCe`
FROM `produtos`
WHERE `id_empresa` = '2'
AND `codigo_de_barras` = '00000'
 LIMIT 1
---
    private function RetornaProduto($VerificaCodigo)
    {
       $DadosProdutos =  $this->produto_model
        ->select('
            id_produto,
            nome,
            unidade,
            codigo_de_barras,
            valor_de_venda,
            NCM,
            CSOSN,
            CFOP_NFe,
            CFOP_NFCe
        ')
        ->where('id_empresa', $this->id_empresa)
        ->where('codigo_de_barras', $VerificaCodigo )
        ->first();

SELECT `id_produto`, `nome`, `unidade`, `codigo_de_barras`, `valor_de_venda`, `NCM`, `CSOSN`, `CFOP_NFe`, `CFOP_NFCe`
FROM `produtos`
WHERE `id_empresa` = '2'
AND `id_produto` = '2'
 LIMIT 1
---
    public function adicionaProdutoPorNome($id_caixa, $id_produto)
    {
        $produto = $this->produto_model
                        ->where('id_empresa', $this->id_empresa)
                        ->where('id_produto', $id_produto)
                        ->select('
                            id_produto,
                            nome,
                            unidade,
                            codigo_de_barras,
                            valor_de_venda,
                            NCM,
                            CSOSN,
                            CFOP_NFe,
                            CFOP_NFCe
                        ')
                        ->first();

        $quantidade     = 1;
        $valor_unitario = $produto['valor_de_venda'];
        $subtotal       = $quantidade * $valor_unitario;
        $desconto       = 0;
        $valor_final    = round($subtotal - $desconto,2);

        $this->produto_pdv_model
            ->where('id_empresa', $this->id_empresa)
            ->insert([
                'nome'             => $produto['nome'],
                'unidade'          => $produto['unidade'],
                'codigo_de_barras' => $produto['codigo_de_barras'],
                'quantidade'       => $quantidade,
                'valor_unitario'   => $valor_unitario,
                'subtotal'         => $subtotal,
                'desconto'         => $desconto,
                'valor_final'      => $valor_final,
                'NCM'              => $produto['NCM'],
                'CSOSN'            => $produto['CSOSN'],
                'CFOP_NFe'         => $produto['CFOP_NFe'],
                'CFOP_NFCe'        => $produto['CFOP_NFCe'],
                'id_produto'       => $produto['id_produto'],
                'id_empresa'       => $this->id_empresa
            ]);

INSERT INTO `vendas` (`valor_a_pagar`, `valor_recebido`, `troco`, `forma_de_pagamento`, `id_vendedor`, `id_cliente`, `data`, `hora`, `id_caixa`, `id_empresa`, `created_at`, `updated_at`) VALUES ('19.5', '', '', 'Dinheiro', '2', '2', '2024-08-17', '19:16:17', '3', '2', '2024-08-17 19:16:17', '2024-08-17 19:16:17')
SELECT *
FROM `produtos`
WHERE `id_empresa` = '2'
AND `id_produto` = '6'
 LIMIT 1
UPDATE `produtos` SET `quantidade` = 5.664, `updated_at` = '2024-08-17 19:16:17'
WHERE `id_empresa` = '2'
AND `id_produto` = '6'
INSERT INTO `produtos_da_venda` (`nome`, `unidade`, `codigo_de_barras`, `quantidade`, `valor_unitario`, `subtotal`, `desconto`, `valor_final`, `NCM`, `CSOSN`, `CFOP_NFe`, `CFOP_NFCe`, `id_produto`, `id_empresa`, `id_venda`, `created_at`, `updated_at`) VALUES ('Diversos', 'KG', '00000', '1', '19.5', '19.5', '0', '19.5', '0', '0', '0', '0', '6', '2', 23, '2024-08-17 19:16:17', '2024-08-17 19:16:17')
---
    public function finalizaVenda($id_caixa)
    {
        $dados = $this->request->getvar();

        // Adiciona data e hora da venda
        $dados['data']     = date('Y-m-d');
        $dados['hora']     = date('H:i:s');
        $dados['id_caixa'] = $id_caixa;

        // Adiciona id da empresa
        $dados['id_empresa'] = $this->id_empresa;

        $id_venda = $this->venda_model
                        ->insert($dados);

        $produtos_do_pdv = $this->produto_pdv_model
                                ->where('id_empresa', $this->id_empresa)
                                ->findAll();

        $produtos_para_o_cupom_nao_fiscal = "";

        foreach ($produtos_do_pdv as $produto) :
            $produto['id_venda'] = $id_venda;

			// Decrementa da quantidade do estoque a quantidade do produto vendido
            $produto_do_estoque = $this->produto_model
                                        ->where('id_empresa', $this->id_empresa)
                                        ->where('id_produto', $produto['id_produto'])
                                        ->first();

            $nova_qtd = $produto_do_estoque['quantidade'] - $produto['quantidade'];

            $this->produto_model
                ->where('id_empresa', $this->id_empresa)
                ->where('id_produto', $produto['id_produto'])
                ->set('quantidade', $nova_qtd)
                ->update();

            $this->produto_da_venda_model
                ->insert($produto);

SELECT *
FROM `empresas`
WHERE `id_empresa` = '2'
 LIMIT 1
SELECT *
FROM `clientes`
WHERE `id_empresa` = '2'
AND `id_cliente` = '2'
 LIMIT 1
---
        );

        // ---------------------------------- MONTAGEM DO CUPOM NÃO FISCAL ------------------------------------------- //
        $empresa  = $this->empresa_model
                        ->where('id_empresa', $this->id_empresa)
                        ->first();

        $cliente  = $this->cliente_model
                        ->where('id_empresa', $this->id_empresa)
                        ->where('id_cliente', $dados['id_cliente'])
                        ->first();